import React from 'react'
import { StyleSheet, Text, View, ImageBackground, ScrollView } from "react-native";


 function SyamRules({navigation}) {
    React.useLayoutEffect(() => {
        navigation.setOptions({headerShown: false});
      }, [navigation]);
  return (
    <ImageBackground blurRadius={10} source={require("../../assets/homeBck.jpg")} style={styles.imgContainer}>
     <ScrollView>
     <Text style={[styles.text,styles.textColor]}>س1: من الذين يباح لهم الفطر في رمضان؟</Text>
     <Text style={styles.text}>ج: الذين يباح لهم الفطر في رمضان أقسام:
الأول: المريض الذي يتضرر بالصوم.
الثاني: المسافر.
ودليلهما قوله تعالى: "فمن شهد منكم الشهر فليصمه ومن كان مريضاً أو على سفر فعدة من أيام أخر" الآية.
الثالث: الحائض والنفساء، والدليل ما روى البخاري ومسلم من حديث عائشة رضي الله عنها قالت: "كانت إحدانا تحيض على عهد رسول الله صلى الله عليه وسلم فنؤمر بقضاء الصوم ولا نؤمر بقضاء الصلاة".
الرابع: الحامل والمرضع، واستدلوا بما يروى عن النبي صلى الله عليه وسلم: "إن الله وضع عن المسافر نصف الصلاة والصوم، وعن الحبلى والمرضع" رواهأحمد والترمذي وأبو داود النسائي، وعليهما القضاء.
الخامس: العاجز عن الصيام لكبر أو مرض لا يرجى برؤه، روى البخاري وغيره عن ابن عباس رضي الله عنهما في قوله تعالى: "وعلى الذين يطيقونه فدية طعام مسكين"، قال ابن عباس رضي الله عنهما: "ليست بمنسوخة، هو الشيخ الكبير والمرأة الكبيرة لا يستطيعان أن يصوما فليطعما مكان كل يوم مسكيناً".
تنبيه: قرر الشيخ محمد بن عثيمين رحمه الله أنه إن قدر شفاء المريض مرضاً لا يرجى برؤه فلا يطالب بقضاء ما أفطر، لأن ذمته برئت بإطعامه.</Text>
     <Text style={[styles.text,styles.textColor]}>س2: ما صفة الإطعام للعاجز عن الصيام؟</Text>
     <Text style={styles.text}>ج: له طريقتان:
الأولى: أن يصنع طعاماً ويدعو المساكين إليه.
الثانية: أن يفرق الطعام على المساكين سواءً كان مطبوخاً أم لا.</Text>
     <Text style={[styles.text,styles.textColor]}>س3: ما حكم السحور لمن أراد الصيام؟</Text>
     <Text style={styles.text}>ج: الأمر بالسحور على الاستحباب كما قرر هذا الشيخ محمد بن صالح بن عثيمين رحمه الله، كما يسن أن يكون السحور في الجزء الأخير من الليل، لقول زيد بن ثابت رضي الله عنه: "تسحرنا مع رسول الله صلى الله عليه وسلم ثم قام إلى الصلاة، فقلت: كم كان بين الأذان والسحور؟ قال: قدر خمسين آية"، رواه البخاري ومسلم، ولقوله صلى الله عليه وسلم: "لا تزال أمتي بخير ما عجلوا الفطر وأخروا السحور" رواه أحمد، ويحصل السحور بأقل ما يتناوله المرء من مأكول ومشروب كما قال ابن حجر رحمه الله في الفتح.</Text>
     <Text style={[styles.text,styles.textColor]}>س4: على ماذا يسن أن يفطر الصائم؟</Text>
     <Text style={styles.text}>ج: الفطر على تمر، فإن لم يجد فعلى ماء، ودليله ما جاء عن سلمان بن عامر رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "إذا كان أحدكم صائماً فليفطر على التمر، فإن لم يجد التمر فعلى الماء، فإن الماء طهور" رواه الخمسة، وقال الترمذي: حديث حسن صحيح.
</Text>
     <Text style={[styles.text,styles.textColor]}>س5: ما هي مفسدات الصوم؟</Text>
     <Text style={styles.text}>ج: للصوم عدة مفسدات:
أولاً: الأكل والشرب عمداً غير نسيان، وقد أجمع على هذا أهل العلم رحمهم الله تعالى، قال تعالى: "وكلوا واشربوا حتى يتبين لكم الخيط الأبيض من الخيط الأسود من الفجر".
والتدخين داخل فيه كما أفتى بهذا الشيخ محمد بن عثيمين رحمه الله وغيره من أهل العلم.
ومثله إدخال شيء إلى الجوف عن طريق الأنف، كقطرة الأنف، وبهذا أفتى الشيخان عبد العزيز بن باز ومحمد بن عثيمين رحمهما الله تعالى، لحديث لقيط بن صبرة مرفوعاً: "وبالغ في الاستنشاق إلا أن تكون صائماً" رواه أبو داود والترمذي والنسائي، وصححه الترمذي، بخلاف قطرة العين فلا تفطر، كما أفتى بهذا الشيخان عبد العزيز بن باز ومحمد بن عثيمين رحمهما الله تعالى.
ثانياً: كل ما يقوم مقام الأكل والشرب في تقوية الجسد فهو مفطر كالإبر المغذية ونحوها، كما أفتى بهذا الشيخان عبد العزيز بن باز ومحمد بن عثيمين رحمهما الله تعالى.
ثالثاً: الجماع، ويكون بإيلاج الذكر في الفرج، وهذا بإجماع أهل العلم رحمهم الله تعالى، وعليه الكفارة، وهي عتق رقبة، فمن لم يجد فصيام شهرين متتابعين، فمن لم يستطع فإطعام ستين مسكيناً.
رابعاً: الحجامة، ومثلها التبرع بالدم الكثير، والفصد، بدليل قوله صلى الله عليه وسلم: "أفطر الحاجم والمحجوم" رواه البخاري، وبهذا أفتى الشيخان عبد العزيز بن باز ومحمد بن عثيمين رحمهما الله.
خامساً: الحيض والنفاس للمرأة، وهذا مفسد للصوم بإجماع العلماء، وقد روى البخاري من حديث عائشة رضي الله عنها أن النبي صلى الله عليه وسلم قال: "أليس إذا حاضت لم تصل ولم تصم"، وأما بالنسبة لاستعمال بعض النساء لحبوب لمنع العادة في رمضان فقد قال الشيخ محمد بن صالح العثيمين رحمه الله: "الذي أرى في هذه المسألة أن النساء لا يستعملن الحبوب، والحمد لله على قدرته وعلى حكمته".
سادساً: التقيؤ عمداً، بدليل ما روي عن النبي صلى الله عليه وسلم أنه قال: "من ذرعه القيء فليس عليه قضاء، ومن استقاء عمداً فليقض" رواه أبو داود والترمذي وغيرهم، وبهذا أفتى الشيخان عبد العزيز بن باز ومحمد بن عثيمين رحمهما الله.
سابعاً: الاستمناء يقظةً، سواءً بقبلة أو لمس أو غيرهما، بدليل قوله صلى الله عليه وسلم: "يترك طعامه وشرابه وشهوته من أجلي" رواه البخاري ومسلم، وقد ذكر ابن قدامة في المغني أن من أنزل بقبلة أو لمس فإنه يفطر بغير خلاف يعلم، وبهذا أفتى الشيخ محمد بن عثيمين رحمه الله تعالى.
ثامناُ: استنشاق البخور متعمداً بحيث يدخل الجوف، لأن له جرماً، وبهذا أفتى الشيخ محمد بن عثيمين رحمه الله تعالى.
تاسعاً: غسيل الكلى، إذا كان بتغيير الدم أو بإضافة مواد غذائية إليه، كما أفتى بهذا الشيخان عبد العزيز بن باز والشيخ محمد بن عثيمين رحمهما الله تعالى.
أخيراً:
ذكر الشيخ محمد بن عثيمين رحمه الله أن هذه المفسدات لا تفطر الصائم إلا بثلاث شروط:
الأول: أن يكون عالماً بالحكم وعالماً بالوقت.
الثاني: أن يكون ذاكراً لصومه.
الثالث: أن يكون مختاراً.</Text>
     <Text style={[styles.text,styles.textColor]}>س6: ما حكم من يفطر عامداً من غير عذر؟</Text>
     <Text style={styles.text}>ج: على خطر عظيم، وقد جاء عن أبي أمامة رضي الله عنه قال: سمعت رسول الله صلى الله عليه وسلم يقول: "بينا أنا نائم إذ أتاني رجلان فأخذا بضَبعَيَّ... وساق الحديث، وفيه: ثم انطلقا بي فإذا قوم معلقون بعراقيبهم مشققة أشداقهم، تسيل أشداقهم دماً، قلت: من هؤلاء؟ قال: هؤلاء الذين يفطرون قبل تحلة صومهم" رواه النسائي في الكبرى وغيره وصححه الذهبي.</Text>
     <Text style={[styles.text,styles.textColor]}>س7: ما حكم استعمال المسواك في نهار رمضان؟</Text>
     <Text style={styles.text}>ج: سنة، وقد روى البخاري في صحيحه من حديث عائشة رضي الله عنها أن النبي صلى الله عليه وسلم قال: "السواك مطهرة للفم مرضاة للرب".</Text>
     <Text style={[styles.text,styles.textColor]}>س8: ما حكم صيام من أذن عليه الفجر وهو جنب؟</Text>
     <Text style={styles.text}>: الصواب صحة صيام، ونقله بعضهم إجماعاً، ويدل عليه ماجاء في صحيح البخاري ومسلم من حديث عائشة رضي الله عنها قالت: "أشهد على رسول الله صلى الله عليه وسلم أنه كان ليصبح جنباً من جماع غير احتلام ثم يصومه"، وكذلك أيضاً إذا طهرت المرأة قبل الفجر، فيجب عليها الصوم ولو لم تغتسل إلا بعد الفجر.</Text>
     <Text style={[styles.text,styles.textColor]}>س9: ما حكم بخاخ الربو للصائم؟</Text>
     <Text style={styles.text}>ج: الصحيح أنه لا يفطر, لأن البخاخ يتبخر ولا يصل للمعدة، وبهذا أفتى الشيخان عبد العزيز بن باز و محمد بن عثيمين رحمهما الله تعالى.
</Text>
     <Text style={[styles.text,styles.textColor]}>س10: ما حكم منظار المعدة للصائم؟</Text>
     <Text style={styles.text}>ج: الصواب أنه لا يفطر، إلا إن وضع مع المنظار مادة دهنية مغذية تسهل دخول المنظار، فهنا يفطر الصائم بهذه المادة لا بدخول المنظار، وبهذا أفتى الشيخ محمد بن عثيمين رحمه الله.
</Text>
     <Text style={[styles.text,styles.textColor]}>س11: ما حكم المراهم للصائم؟</Text>
     <Text style={styles.text}>ج: لا تفطر، لأنها ليست أكلاً ولا شرباً، ولا هي بمعنى الأكل والشرب، ومثلها اللصقات العلاجية.</Text>
     <Text style={[styles.text,styles.textColor]}>س12: ما حكم الحقنة الشرجية للصائم؟</Text>
     <Text style={styles.text}>ج: الصواب أنها لا تفطر، لأنها لا تغذي بل تستفرغ ما في البدن، وبهذا أفتى الشيخ محمد بن عثيمين إذا كانت دواءً لا غذاءً.</Text>
     <Text style={[styles.text,styles.textColor]}>س13: ما حكم التحاميل للصائم؟</Text>
     <Text style={styles.text}>ج: التحاميل لا تفطر، وبهذا أفتى الشيخ محمد بن عثيمين رحمه الله، لأنها تحتوي على مادة دوائية، وليست أكلاً ولا شرباً ولا بمعناهما.</Text>
     <Text style={[styles.text,styles.textColor]}>س14: هل الغيبة والنميمة تفطران الصائم؟</Text>
     <Text style={styles.text}>ج: لاتفطران الصائم، لكن تنقصان من أجره، وقد روى أبو هريرة عن النبي صلى الله عليه وسلم قال: "من لم يدع قول الزور والعمل به فليس لله حاجة في أن يدع طعامه وشرابه" رواه البخاري.</Text>
     <Text style={[styles.text,styles.textColor]}>س15: هل يُذكّر الذي يأكل أو يشرب ناسياً؟</Text>
     <Text style={styles.text}>ج: نعم يُذكَّر، وقد استدل الشيخ محمد بن عثيمين رحمه الله على ذلك بما روى البخاري ومسلم في صحيحيهما أن النبي صلى الله عليه وسلم قال حين سها في صلاته: "فإذا نسيت فذكروني" رواه البخاري ومسلم.
ويستدل أيضاً بقوله صلى الله عليه وسلم: "من رأى منكم منكراً فليغيره بيده، فإن لم يستطع فبلسانه، فإن لم يستطع فبقلبه وذلك أضعف الإيمان" رواه مسلم.</Text>
     <Text style={[styles.text,styles.textColor]}>س16: من مات وعليه صيام، فمتى يصوم عنه وليه؟</Text>
     <Text style={styles.text}>ج: فصل في هذا الشيخ محمد بن عثيمين رحمه الله على النحو التالي:
الأول: إنسان كان مريضاً مرضاً لا يرجى برؤه، فهذا فيه فدية طعام مسكين، ولا يُصام عنه.
الثاني: إنسان مريض مرضاً يرجى برؤه ففرضه عدة من أيام أخر، فإن قُدِّرَ أن هذا المرض استمر به حتى مات فلا شيء عليه، لأنه مات قبل أن يتمكن منها.
الثالث: إنسان مريض مرضاً يرجى برؤه فشفاه الله، أو كان مسافراً مفطراً، ففرط في القضاء مع استطاعته حتى مات، فهذا هو الذي يصوم عنه وليه.</Text>
     <Text style={[styles.text,styles.textColor]}>س17: ما أفضل صيام النوافل؟</Text>
     <Text style={styles.text}>ج: روى البخاري ومسلم من حديث عبد الله بن عمرو أن النبي صلى الله عليه وسلم قال له: "صم يوماً وأفطر يوماً، فذلك صيام داود عليه السلام وهو أفضل الصيام" فقال عبد الله: إني أطيق أفضل من ذلك؟ فقال صلى الله عليه وسلم: "لا أفضل من ذلك".</Text>
     <Text style={[styles.text,styles.textColor]}>س18: ما هو الاعتكاف؟</Text>
     <Text style={styles.text}>ج: قال الشيخ محمد بن عثيمين رحمه الله: هو لزوم مسجد لطاعة الله.</Text>
     <Text style={[styles.text,styles.textColor]}>س19:ما حكم الاعتكاف؟</Text>
     <Text style={styles.text}>ج: سنة بإجماع أهل العلم، قال تعالى: "أن طهرا بيتي للطائفين والعاكفين والركع السجود"، وجاء في البخاري ومسلم وغيرهما أنه صلى الله عليه وسلم كان يعتكف العشر الأواخر من رمضان.
وقال الشيخ عبد العزيز بن باز في فتاواه (15/437): "لا ريب أن الاعتكاف في المسجد قربة من القرب، وفي رمضان أفضل من غيره لقول الله تعالى: "ولا تباشروهن وأنتم عاكفون في المساجد"، ولأن النبي صلى الله عليه وسلم كان يعتكف العشر الأواخر من رمضان، وترك ذلك مرةً فاعتكف في شوال، والمقصود من ذلك هو التفرغ للعبادة، والخلوة بالله لذلك، وهذه هي الخلوة الشرعية، وقال بعضهم في تعريف الاعتكاف: هو قطع العلائق الشاغلة عن طاعة الله وعبادته، وهو مشروع في رمضان وغيره كما تقدم، ومع الصيام أفضل، وإن اعتكف من غير صوم فلا بأس على الصحيح من قولي العلماء"</Text>
     <Text style={[styles.text,styles.textColor]}>س20: هل لقيام الليل عدد معين من الركعات؟</Text>
     <Text style={styles.text}>ج:ليس له عدد معين، لكن السنة كما كان يفعل صلى الله عليه وسلم وهي إحدى عشرة ركعة، فقد روى البخاري ومسلم من حديث عائشة رضي الله عنها قالت: "ما كان رسول الله صلى الله عليه وسلم يزيد في رمضان ولا في غيره على إحدى عشرة ركعة"، ولو صلى ثلاث عشرة ركعة كما جاء عنه صلى الله عليه وسلم في بعض الروايات فهو سنة أيضاً، وتجوز الزيادة والنقصان على هذا العدد.</Text>

     </ScrollView>
    </ImageBackground>
  )
}
export default SyamRules;
const styles = StyleSheet.create({
  container: {
    flex: 1,
    alignItems: "center",
    justifyContent: "center",
  },
  imgContainer:{
    flex: 1,
    backgroundColor: '#3A0CA3',
    alignItems: 'center',
    justifyContent: 'center',
  },
  Image: {
    width:274,
    height:274
  },
  text:{
    textAlign:"center",
    marginTop:5,
    marginBottom:5,
    fontSize:17,
    fontWeight:"bold",
    padding:5,
    color:"white"
  },
  textColor:{
    color:"#ffa90f"
  },
  secText:{
    color:"#1CA3B6",
  }
})